tests/load/basic-load.yml
# Basic Load Test Configuration for Passport Agent API
# Uses Artillery.js YAML syntax
# Install: npm install -g artillery
# Run:    artillery run tests/load/basic-load.yml
#
# Tests:
#   - /health endpoint at 100 RPS for 60 seconds
#   - /metrics endpoint at 50 RPS for 60 seconds

config:
  target: "{{ $processEnvironment.API_URL || 'http://localhost:3000' }}"
  phases:
    # Warm-up phase
    - duration: 10
      arrivalRate: 10
      name: "Warm up"
    # Ramp up to 100 RPS for /health
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 RPS"
    # Sustained load at 100 RPS
    - duration: 60
      arrivalRate: 100
      name: "Sustained 100 RPS"
    # Cool-down phase
    - duration: 10
      arrivalRate: 10
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 200
        - http.response_time.p99: 500
        - http.error_rate: 0.01
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./load-helpers.js"

scenarios:
  # Scenario 1: Health check (primary load target — 100 RPS)
  - name: "Health Check"
    weight: 67
    flow:
      - get:
          url: "/health"
          capture:
            - json: "$.status"
              as: "health_status"
          expect:
            - statusCode: 200
            - contentType: json
            - equals:
                - "{{ health_status }}"
                - "ok"

  # Scenario 2: Metrics endpoint (secondary target — ~50 RPS weighted)
  - name: "Metrics Query"
    weight: 33
    flow:
      - get:
          url: "/metrics"
          capture:
            - json: "$.tasks.total"
              as: "task_total"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "tasks"
            - hasProperty: "runs"
            - hasProperty: "agents"